# MySQL

# Clients

In [2]:
%load_ext sql
# %reload_ext sql

%sql mysql+pymysql://root:change_me@127.0.0.1:3306/devops?charset=utf8mb4

Connecting to 'mysql+pymysql://root:***@127.0.0.1:3306/devops?charset=utf8mb4'

# JOIN

In [3]:
%%sql
SELECT *
FROM
(
-- student
SELECT 1 AS id, '张三' AS name, 18 AS age, 2 as class_id
UNION
SELECT 2 AS id, '李四' AS name, 19 AS age, 3 as class_id
UNION
SELECT 3 AS id, '王五' AS name, 20 AS age, 4 as class_id
UNION
SELECT 4 AS id, '陈六' AS name, 21 AS age, 1 as class_id
) AS s

LEFT JOIN

(
-- class
SELECT 1 AS id, '一年级一班' AS name
UNION
SELECT 2 AS id, '二年级二班' AS name
UNION
SELECT 3 AS id, '三年级三班' AS name
UNION
SELECT 4 AS id, '四年级四班' AS name
) AS c

ON (s.class_id = c.id)

Running query in 'mysql+pymysql://root:***@127.0.0.1:3306/devops?charset=utf8mb4'

4 rows affected.

+----+------+-----+----------+------+------------+
| id | name | age | class_id | id_1 |   name_1   |
+----+------+-----+----------+------+------------+
| 1  | 张三 |  18 |    2     |  2   | 二年级二班 |
| 2  | 李四 |  19 |    3     |  3   | 三年级三班 |
| 3  | 王五 |  20 |    4     |  4   | 四年级四班 |
| 4  | 陈六 |  21 |    1     |  1   | 一年级一班 |
+----+------+-----+----------+------+------------+

In [6]:
%%sql
SELECT *
FROM
(
-- student
SELECT 1 AS id, '张三' AS name, 18 AS age, 2 as class_id
UNION
SELECT 2 AS id, '李四' AS name, 19 AS age, 3 as class_id
UNION
SELECT 3 AS id, '王五' AS name, 20 AS age, 4 as class_id
UNION
SELECT 4 AS id, '陈六' AS name, 21 AS age, 1 as class_id
) AS s

LEFT JOIN

(
-- class
SELECT 1 AS id, '一年级一班' AS name
UNION
SELECT 2 AS id, '二年级二班' AS name
UNION
SELECT 3 AS id, '三年级三班' AS name
UNION
SELECT 4 AS id, '四年级四班' AS name
) AS c

-- 不管ON上的条件是否为真都会返回left表中的数据
-- 条件不为真时, 不返回right中的数据
-- ON (s.class_id = c.id AND s.name = '张三')
ON (s.class_id = c.id AND c.name = '二年级二班')

Running query in 'mysql+pymysql://root:***@127.0.0.1:3306/devops?charset=utf8mb4'

4 rows affected.

+----+------+-----+----------+------+------------+
| id | name | age | class_id | id_1 |   name_1   |
+----+------+-----+----------+------+------------+
| 1  | 张三 |  18 |    2     |  2   | 二年级二班 |
| 2  | 李四 |  19 |    3     | None |    None    |
| 3  | 王五 |  20 |    4     | None |    None    |
| 4  | 陈六 |  21 |    1     | None |    None    |
+----+------+-----+----------+------+------------+

In [ ]:
%%sql
SELECT *
FROM
(
-- student
SELECT 1 AS id, '张三' AS name, 18 AS age, 2 as class_id
UNION
SELECT 2 AS id, '李四' AS name, 19 AS age, 3 as class_id
UNION
SELECT 3 AS id, '王五' AS name, 20 AS age, 4 as class_id
UNION
SELECT 4 AS id, '陈六' AS name, 21 AS age, 1 as class_id
) AS s

LEFT JOIN

(
-- class
SELECT 1 AS id, '一年级一班' AS name
UNION
SELECT 2 AS id, '二年级二班' AS name
UNION
SELECT 3 AS id, '三年级三班' AS name
UNION
SELECT 4 AS id, '四年级四班' AS name
) AS c

ON (s.class_id = c.id)

-- 过滤最终的结果
WHERE  s.name = '张三'

Running query in 'mysql+pymysql://root:***@127.0.0.1:3306/devops?charset=utf8mb4'

1 rows affected.

+----+------+-----+----------+------+------------+
| id | name | age | class_id | id_1 |   name_1   |
+----+------+-----+----------+------+------------+
| 1  | 张三 |  18 |    2     |  2   | 二年级二班 |
+----+------+-----+----------+------+------------+